Repository: dimasdelonge-alt/data-grooming
Catalog: lib/l10n/app_*.arb
Languages: id, ms

source: Check-out Date
id: Tanggal Keluar
ms: Tarikh Daftar Keluar

source: Delete Booking
id: Hapus Booking
ms: Padam Tempahan

# deleteBookingConfirmTitle
source: Delete Booking?
id: Hapus Booking?
ms: Padam Tempahan?

# deleteBookingConfirmDesc
source: This action cannot be undone.
id: Tindakan ini tidak dapat dibatalkan.
ms: Tindakan ini tidak boleh dibatalkan.

source: View Billing
id: Lihat Tagihan
ms: Lihat Pengebilan

source: No active billing.
id: Tidak ada tagihan aktif.
ms: Tiada pengebilan aktif.

source: No billing.
id: Tidak ada tagihan.
ms: Tiada pengebilan.

# noHistory
source: No history yet.
id: Belum ada riwayat.
ms: Tiada sejarah lagi.

source: {count} Cats
id: {count} Kucing
ms: {count} Kucing

source: Add Room
id: Tambah Kamar
ms: Tambah Bilik

source: Edit Room
id: Edit Kamar
ms: Sunting Bilik

source: Room Name
id: Nama Kamar
ms: Nama Bilik

source: Price per Night
id: Harga per Malam
ms: Harga semalam

source: Capacity
id: Kapasitas
ms: Kapasiti

source: OVERDUE!
id: TERLAMBAT!
ms: TERLEWAT!

source: Occupied
id: Terisi
ms: Penghuni

source: Available
id: Kosong
ms: Kosong

source: Locked
id: Terkunci
ms: Dikunci

source: Room/Cat
id: Kamar/Kucing
ms: Bilik/Kucing

# paid
source: Paid / Overpaid
id: Lunas / Lebih Bayar
ms: Dibayar / Terlebih Bayar

source: Remaining Billing
id: Sisa Tagihan
ms: Baki Pengebilan

source: Now
id: Sekarang
ms: Sekarang

source: Running...
id: Berjalan...
ms: Berjalan...

# addOnCosts
source: Additional Costs
id: Biaya Tambahan
ms: Kos Tambahan

source: Manage Add-ons
id: Kelola Add-on
ms: Urus Tambahan

# downPayment
source: Down Payment (DP):
id: Uang Muka (DP):
ms: Bayaran Pendahuluan (DP):

source: Total Cost (Est):
id: Total Biaya (Est):
ms: Jumlah Kos (Anggaran):

source: Invoice DP
ms: Invois DP

source: Check Out
ms: Daftar Keluar

# noAddOns
source: No additional items.
id: Belum ada item tambahan.
ms: Tiada item tambahan.

source: Update Total DP
ms: Kemas Kini Jumlah DP

# dpDistributeDesc
source: This DP will be distributed evenly to all bookings in this group.
id: DP ini akan dibagi rata ke semua booking dalam grup ini.
ms: DP ini akan dibahagikan sama rata kepada semua tempahan dalam kumpulan ini.

source: Total DP
ms: Jumlah DP

source: Confirm Check Out
id: Konfirmasi Check Out
ms: Sahkan Daftar Keluar

# checkoutConfirmDesc
source: Complete {count} booking(s) for {ownerName}?
id: Selesaikan {count} booking untuk {ownerName}?
ms: Lengkapkan {count} tempahan untuk {ownerName}?

# totalLabel
source: Total
ms: Jumlah

source: Select Cat/Room
id: Pilih Kucing/Kamar
ms: Pilih Kucing/Bilik

# itemNameExample
source: Item Name (Example: Whiskas)
id: Nama Item (Contoh: Whiskas)
ms: Nama Item (Contoh: Whiskas)

source: Price
id: Harga
ms: Harga

source: Add Item
id: Tambah Item
ms: Tambah Item

source: Customer Deposit
id: Deposit Pelanggan
ms: Deposit Pelanggan

source: Top Up
ms: Tambah Nilai

source: Search Name / Phone
id: Cari Nama / No HP
ms: Cari Nama / No HP

# noDepositData
source: No deposit data found.
id: Belum ada data deposit.
ms: Tiada data deposit.

source: No Name
id: Tanpa Nama
ms: Tiada Nama

source: Top Up Balance
id: Top Up Saldo
ms: Tambah Nilai Baki

source: New Deposit
id: Deposit Baru
ms: Deposit Baru

# phoneId
source: Phone No. (ID)
id: No. HP (ID)
ms: No. HP (ID)

source: Top Up Amount
id: Jumlah Top Up
ms: Jumlah Tambah Nilai

source: Notes (Optional)
id: Catatan (Opsional)
ms: Nota (Pilihan)

# historyPrefix
source: History: {name}
id: Riwayat: {name}
ms: Sejarah: {name}

# currentBalanceValue
source: Current Balance: {balance}
id: Saldo Saat Ini: {balance}
ms: Baki Semasa: {balance}

# ownerPhoneValue
source: Phone: {phone}
id: HP: {phone}
ms: HP: {phone}

# shareHistoryStatement
source: Share History (Account Statement)
id: Bagikan Riwayat (Rekening Koran)
ms: Kongsi Sejarah (Penyata Akaun)

# noTransactions
source: No transactions found.
id: Belum ada transaksi.
ms: Tiada transaksi dijumpai.

# transTopUp
source: Top Up
ms: Tambah Nilai

# transGroomingPayment
source: Grooming Payment
id: Bayar Grooming
ms: Pembayaran Grooming

# transHotelPayment
source: Hotel Payment
id: Bayar Hotel
ms: Pembayaran Hotel

# transAdjustment
source: Adjustment
id: Penyesuaian
ms: Penyelarasan

# transRefund
source: Refund
ms: Bayaran Balik

source: Adjust Balance
id: Adjust Saldo
ms: Laras Baki

source: New Balance
id: Saldo Baru
ms: Baki Baru

# adjustmentReason
source: Reason (Optional)
id: Alasan (Opsional)
ms: Sebab (Pilihan)

source: Delete Deposit
id: Hapus Deposit
ms: Padam Deposit

# deleteDepositConfirm
source: Delete deposit for {name}? All transaction history will be deleted. This action cannot be undone.
id: Hapus deposit {name}? Semua riwayat transaksi akan ikut terhapus. Data tidak bisa dikembalikan.
ms: Padam deposit untuk {name}? Semua sejarah transaksi akan dipadamkan. Tindakan ini tidak boleh diundur.

source: Top Up Again
id: Top Up Lagi
ms: Tambah Nilai Lagi

source: Close
id: Tutup
ms: Tutup

# sameOwnerOnly
source: Can only select transactions from the same owner ({owner})
id: Hanya bisa memilih transaksi dari pemilik yang sama ({owner})
ms: Hanya boleh pilih transaksi daripada pemilik yang sama ({owner})

source: Financial Report
id: Laporan Keuangan
ms: Laporan Kewangan

source: Print Report
id: Cetak Laporan
ms: Cetak Laporan

# ownerSameHint
source: Owner: {owner} — only transactions from this owner
id: Owner: {owner} — hanya transaksi dari owner ini
ms: Pemilik: {owner} — hanya transaksi daripada pemilik ini

# incomeDetailsHeader
source: Income Details
id: Rincian Pemasukan
ms: Butiran Pendapatan

# transactionHistoryHeader
source: Transaction History
id: Riwayat Transaksi
ms: Sejarah Transaksi

# longPressCombineHint
source: Long press to select & print combined invoice (1 owner)
id: Tekan lama untuk memilih & cetak invoice gabungan (1 owner)
ms: Tekan lama untuk memilih & cetak invois gabungan (1 pemilik)

source: Add Expense
id: Tambah Pengeluaran
ms: Tambah Perbelanjaan

source: Description
id: Keterangan
ms: Keterangan

# amountRp
source: Amount
id: Jumlah
ms: Jumlah

# generalCategory
source: General
id: Umum
ms: Umum

# deleteConfirmTitle
source: Delete Data?
id: Hapus Data
ms: Padam Data

# deleteExpenseConfirm
source: Are you sure you want to delete this expense?
id: Hapus pengeluaran ini?
ms: Padam perbelanjaan ini?

source: Room Detail
id: Detail Kamar
ms: Butiran Bilik

source: Room not found.
id: Kamar tidak ditemukan.
ms: Bilik tidak dijumpai.

# capacityLabel
source: Capacity: {count}
id: Kapasitas: {count}
ms: Kapasiti: {count}

# pricePerNightLabel
source: {price} / night
id: {price} / malam
ms: {price} / malam

source: Status: OCCUPIED
id: Status: TERISI
ms: Status: PENGHUNI

source: Status: AVAILABLE
id: Status: KOSONG
ms: Status: KOSONG

# checkInButton
source: Check In
ms: Daftar Masuk

# checkOutButton
source: Check Out
ms: Daftar Keluar

# checkInRoom
source: Check In (Enter Room)
id: Check In (Masuk Kamar)
ms: Daftar Masuk (Masuk Bilik)

source: Update Price
id: Update Harga
ms: Kemas Kini Harga

source: Cat not registered?
id: Kucing belum terdaftar?
ms: Kucing belum didaftarkan?

source: Cancel Add
id: Batal Tambah
ms: Batal Tambah

source: Add New
id: Tambah Baru
ms: Tambah Baru

source: New Cat Data
id: Data Kucing Baru
ms: Data Kucing Baru

# ownerNameLabel
source: Owner Name
id: Nama Pemilik
ms: Nama Pemilik

# catAddedSuccess
source: Cat added successfully!
id: Kucing berhasil ditambahkan!
ms: Kucing berjaya ditambah!

source: Select Date
id: Pilih Tanggal
ms: Pilih Tarikh

source: Confirm Check Out
id: Konfirmasi Check Out
ms: Sahkan Daftar Keluar

# finishBookingConfirm
source: Finish this booking? Room will become available.
id: Selesaikan booking ini? Kamar akan menjadi kosong.
ms: Selesaikan tempahan ini? Bilik akan menjadi kosong.

source: Manage Services
id: Manajemen Layanan
ms: Pengurusan Perkhidmatan

# noServices
source: No services yet.
id: Belum ada layanan.
ms: Tiada perkhidmatan lagi.

# tapPlusAddService
source: Tap the + button to add a service.
id: Tap tombol + untuk menambah layanan.
ms: Ketik butang + untuk menambah perkhidmatan.

source: Edit Service
id: Edit Layanan
ms: Edit Perkhidmatan

source: Add Service
id: Tambah Layanan
ms: Tambah Perkhidmatan

source: Service Name
id: Nama Layanan
ms: Nama Perkhidmatan

source: Invalid price
id: Harga tidak valid
ms: Harga tidak sah

# requiredField
source: This field is required
id: Kolom ini wajib diisi
ms: Medan ini diperlukan

source: Delete Service
id: Hapus Layanan
ms: Padam Perkhidmatan

# deleteServiceConfirm
source: Permanently delete "{name}"?
id: Hapus "{name}" secara permanen?
ms: Padam "{name}" secara kekal?

# readImageFailed
source: Failed to read file: bytes empty (0 bytes)
id: Gagal baca file: bytes kosong (0 bytes)
ms: Gagal membaca fail: bait kosong (0 bait)

# compressionFailed
source: Compression failed: {error}
id: Kompresi gagal: {error}
ms: Mampatan gagal: {error}

# compressionResultEmpty
source: Compression result empty (null/empty)
id: Hasil kompresi kosong (null/empty)
ms: Hasil mampatan kosong (null/kosong)

source: Appearance
id: Tampilan
ms: Penampilan

source: Follow System
id: Ikuti Sistem
ms: Ikut Sistem

source: Light Mode
id: Mode Terang
ms: Mod Cerah

source: Dark Mode
id: Mode Gelap
ms: Mod Gelap

source: Language
id: Bahasa
ms: Bahasa

source: Shop Branding
id: Branding Toko
ms: Penjenamaan Kedai

source: Invoice Logo
id: Logo Invoice
ms: Logo Invois

# logoCustomizationDesc
source: Customize the logo for your receipts/invoices.
id: Sesuaikan logo untuk struk/invoice Anda.
ms: Sesuaikan logo untuk resit/invois anda.

# upgradeToProForLogo
source: Upgrade to PRO to change the logo.
id: Upgrade ke PRO untuk ganti logo.
ms: Naik taraf ke PRO untuk tukar logo.

# proFeatureUpgradeRequired
source: PRO feature! Please upgrade your subscription.
id: Fitur khusus PRO! Silakan upgrade langganan.
ms: Ciri PRO! Sila naik taraf langganan anda.

source: Business Information
id: Informasi Bisnis
ms: Maklumat Perniagaan

source: Business Name
id: Nama Bisnis
ms: Nama Perniagaan

source: Business Phone
id: Nomor Telepon
ms: Nombor Telefon

# invoiceHeaderHint
source: Used for receipt/invoice header
id: Untuk header struk/invoice
ms: Digunakan untuk pengepala resit/invois

source: Business Address
id: Alamat Bisnis
ms: Alamat Perniagaan

# shopIdLowerHint
source: Use lowercase, no spaces
id: Gunakan huruf kecil, tanpa spasi
ms: Gunakan huruf kecil, tanpa ruang

# shopIdChangedSyncAccount
source: Shop ID changed. Check Account menu for synchronization.
id: ID Toko berubah. Cek menu Akun untuk Sinkronisasi.
ms: ID Kedai berubah. Semak menu Akaun untuk penyelarasan.

source: Changes saved
id: Perubahan Disimpan
ms: Perubahan disimpan

source: Save Changes
id: Simpan Perubahan
ms: Simpan Perubahan

source: Notification Settings
id: Pengaturan Notifikasi
ms: Tetapan Notifikasi

source: Enable Reminders
id: Aktifkan Pengingat
ms: Aktifkan Peringatan

source: H-1 notification active
id: Notifikasi H-1 aktif
ms: Notifikasi H-1 aktif

source: Notifications disabled
id: Notifikasi dimatikan
ms: Notifikasi dimatikan

source: Reminder Time (H-1)
id: Waktu Pengingat (H-1)
ms: Waktu Peringatan (H-1)

# wibTimeLabel
source: Time: {time} WIB
id: Jam: {time} WIB
ms: Masa: {time} WIB

source: Set Reminder Time
id: Atur Waktu Pengingat
ms: Tetap Waktu Peringatan

# reminderTimeDesc
source: Notifications will appear 1 day before the schedule (H-1) at the specified time.
id: Notifikasi akan muncul 1 hari sebelum jadwal (H-1) pada jam yang ditentukan.
ms: Notifikasi akan muncul 1 hari sebelum jadual (H-1) pada masa yang ditetapkan.

source: Hour (0-23)
id: Jam (0-23)
ms: Jam (0-23)

source: Minute (0-59)
id: Menit (0-59)
ms: Minit (0-59)

# invalidNumber
source: Enter a valid number
id: Masukkan angka yang valid
ms: Masukkan nombor yang sah

# hourLimit
source: Hour must be 0-23
id: Jam harus 0-23
ms: Jam mestilah 0-23

# minuteLimit
source: Minute must be 0-59
id: Menit harus 0-59
ms: Minit mestilah 0-59

source: Reminder time saved!
id: Waktu pengingat disimpan!
ms: Waktu peringatan disimpan!

source: Security
id: Keamanan
ms: Keselamatan

source: App Lock (PIN)
id: Kunci Aplikasi (PIN)
ms: Kunci Aplikasi (PIN)

source: PIN Active
id: PIN Aktif
ms: PIN Aktif

source: Lock disabled
id: Kunci dimatikan
ms: Kunci dimatikan

# lockDisabledMsg
source: App Lock Disabled
id: Kunci Aplikasi Dimatikan
ms: Kunci Aplikasi Dimatikan

source: Biometric (Fingerprint)
id: Biometrik (Sidik Jari)
ms: Biometrik (Cap Jari)

source: Active
id: Aktif
ms: Aktif

source: Inactive
id: Tidak Aktif
ms: Tidak Aktif

# setNewPin6Digit
source: Set New PIN (6 Digits)
id: Atur PIN Baru (6 Digit)
ms: Tetap PIN Baru (6 Digit)

source: New PIN
id: PIN Baru
ms: PIN Baru

source: Confirm PIN
id: Konfirmasi PIN
ms: Sahkan PIN

# pinMustBe6Digit
source: PIN must be 6 digits
id: PIN harus 6 digit
ms: PIN mestilah 6 digit

source: PIN mismatch
id: PIN tidak cocok
ms: PIN tidak sepadan

# pinSuccessSet
source: PIN set successfully!
id: PIN Berhasil Diatur!
ms: PIN Berhasil Ditetapkan!

source: About App
id: Tentang Aplikasi
ms: Tentang Aplikasi

# versionStable
source: Version 13.0 (Stable)
id: Versi 13.0 (Stable)
ms: Versi 13.0 (Stabil)

# thankYouUsingApp
source: Thank you for using the app.
id: Terima kasih telah menggunakan aplikasi ini.
ms: Terima kasih kerana menggunakan aplikasi ini.

# statusWaiting
source: Waiting
id: Menunggu
ms: Menunggu

# statusBathing
source: Bathing
id: Mandi
ms: Mandi

# statusDrying
source: Drying
id: Pengeringan
ms: Pengeringan

# statusPickupReady
source: Pickup Ready
id: Siap Jemput
ms: Sedia Jemput

# statusDone
source: Done
id: Selesai
ms: Selesai

# deviceWebBrowser
source: Web Browser
id: Browser Web
ms: Pelayar Web

# deviceAndroid
source: Android Device
id: Perangkat Android
ms: Peranti Android

# deviceIosOther
source: iOS/Other Device
id: Perangkat iOS/Lainnya
ms: Peranti iOS/Lain-lain

source: Change Password
id: Ubah Password
ms: Tukar Kata Laluan

source: Old Password
id: Password Lama
ms: Kata Laluan Lama

source: New Password
id: Password Baru
ms: Kata Laluan Baru

source: Confirm New Password
id: Konfirmasi Password Baru
ms: Sahkan Kata Laluan Baru

# passwordMinLength
source: Password must be at least 6 characters
id: Password minimal 6 karakter
ms: Kata laluan mestilah sekurang-kurangnya 6 aksara

# passwordMismatch
source: New passwords do not match
id: Password baru tidak cocok
ms: Kata laluan baru tidak sepadan

# wrongOldPassword
source: Old password is incorrect
id: Password lama salah
ms: Kata laluan lama tidak betul

# passwordChanged
source: Password changed successfully!
id: Password berhasil diubah!
ms: Kata laluan berjaya ditukar!

# passwordChangeFailed
source: Failed to change password
id: Gagal mengubah password
ms: Gagal menukar kata laluan
