Repository: dimasdelonge-alt/data-grooming
Catalog: lib/l10n/app_*.arb
Languages: id, ms

source: Save
id: Simpan
ms: Simpan

source: Cancel
id: Batal
ms: Batal

source: Delete
id: Hapus
ms: Padam

source: Edit
id: Ubah
ms: Sunting

source: Yes
id: Ya
ms: Ya

source: No
id: Tidak
ms: Tidak

source: Success
id: Berhasil
ms: Berjaya

source: Error
id: Galat
ms: Ralat

source: Loading...
id: Memuat...
ms: Memuatkan...

source: Search
id: Cari
ms: Cari

source: Settings
id: Pengaturan
ms: Tetapan

source: Account
id: Akun
ms: Akaun

source: Recent Activity
id: Aktivitas Terbaru
ms: Aktiviti Terkini

source: Cat List
id: Daftar Kucing
ms: Senarai Kucing

# businessNamePlaceholder
source: Business Name
id: Nama Bisnis
ms: Nama Perniagaan

source: Good Morning
id: Selamat Pagi
ms: Selamat Pagi

source: Good Afternoon
id: Selamat Siang
ms: Selamat Tengah Hari

source: Good Evening
id: Selamat Sore
ms: Selamat Petang

source: Good Night
id: Selamat Malam
ms: Selamat Malam

source: Net Profit
id: Laba Bersih
ms: Untung Bersih

source: Income
id: Pemasukan
ms: Pendapatan

source: Expense
id: Pengeluaran
ms: Perbelanjaan

source: New Session
id: Sesi Baru
ms: Sesi Baru

source: Cats
id: Kucing
ms: Kucing

source: Booking
ms: Tempahan

source: Services
id: Layanan
ms: Servis

source: Calendar
id: Kalender
ms: Kalendar

source: Active Sessions
id: Sesi Aktif
ms: Sesi Aktif

source: Processing now
id: Sedang diproses sekarang
ms: Sedang diproses sekarang

source: See All
id: Lihat Semua
ms: Lihat Semua

source: Grooming Schedule
id: Jadwal Grooming
ms: Jadual Grooming

# noReschedule
source: No reschedule needed
id: Tidak ada jadwal ulang
ms: Tiada jadual semula

source: Owner
id: Pemilik
ms: Pemilik

# sessionsCountLabel
source: {count} sessions
id: {count} sesi
ms: {count} sesi

# daysAgoLabel
source: {days} days ago
id: {days} hari lalu
ms: {days} hari lepas

# errEmptyShopIdPassword
source: Shop ID and Password cannot be empty
id: Shop ID dan Password harus diisi
ms: Shop ID dan Kata Laluan mesti diisi

# errShopIdNotFound
source: Shop ID not found
id: Shop ID tidak ditemukan
ms: Shop ID tidak dijumpai

# errDeviceLimit
source: Login denied: Device limit reached ({count} device).\nPlease upgrade to PRO for more access.
id: Login ditolak: Limit perangkat tercapai ({count} device).\nSilakan upgrade ke PRO untuk akses lebih banyak.
ms: Log masuk ditolak: Had peranti dicapai ({count} peranti).\nSila naik taraf ke PRO untuk akses lebih.

# errWrongPassword
source: Wrong password
id: Password salah
ms: Kata laluan salah

# errNetwork
source: Failed to connect to server
id: Gagal terhubung ke server
ms: Gagal menyambung ke pelayan

# errAllFieldsRequired
source: All fields are required
id: Semua field harus diisi
ms: Semua ruangan mesti diisi

# errInvalidShopId
source: Shop ID cannot contain spaces or /
id: Shop ID tidak boleh mengandung spasi atau /
ms: Shop ID tidak boleh mengandungi ruang kosong atau /

# errPasswordMinLength
source: Password must be at least 6 characters
id: Password minimal 6 karakter
ms: Kata laluan minimum 6 aksara

# errPasswordMismatch
source: Passwords do not match
id: Password tidak cocok
ms: Kata laluan tidak sepadan

# errShopIdTaken
source: Shop ID "{shopId}" is already taken, try another
id: Shop ID "{shopId}" sudah dipakai, coba yang lain
ms: Shop ID "{shopId}" sudah digunakan, cuba yang lain

# errCreateAccount
source: Failed to create account: {error}
id: Gagal membuat akun: {error}
ms: Gagal mencipta akaun: {error}

# msgForgotPwdWithId
source: Hello, I forgot my SmartGroomer password. My Shop ID is: {shopId}
id: Halo, saya lupa password SmartGroomer. Shop ID saya: {shopId}
ms: Helo, saya terlupa kata laluan SmartGroomer. Shop ID saya: {shopId}

# msgForgotPwd
source: Hello, I forgot my SmartGroomer password.
id: Halo, saya lupa password SmartGroomer.
ms: Helo, saya terlupa kata laluan SmartGroomer.

# createAccount
source: Create New Account
id: Buat Akun Baru
ms: Cipta Akaun Baru

source: Sign In to Account
id: Masuk ke Akun
ms: Log Masuk Akaun

# shopIdHint
source: e.g. jeni_cathouse
id: cth: jeni_cathouse
ms: cth: jeni_cathouse

source: Password
ms: Kata Laluan

source: Repeat Password
id: Ulangi Password
ms: Ulangi Kata Laluan

source: Register
id: Daftar
ms: Daftar

source: Login
id: Masuk
ms: Log Masuk

# alreadyHaveAccount
source: Already have an account? Login
id: Sudah punya akun? Masuk
ms: Sudah mempunyai akaun? Log Masuk

# dontHaveAccount
source: Don't have an account? Create New
id: Belum punya akun? Buat Baru
ms: Belum ada akaun? Cipta Baru

# forgotPasswordAdmin
source: Forgot Password? Contact Admin
id: Lupa Password? Hubungi Admin
ms: Lupa Kata Laluan? Hubungi Admin

# accountAndBackup
source: Account & Backup
id: Akun & Backup
ms: Akaun & Sandaran

# shopSync
source: Shop Synchronization
id: Sinkronisasi Toko
ms: Penyegerakan Kedai

source: Shop Connected
id: Toko Terhubung
ms: Kedai Disambungkan

source: Connect Shop
id: Hubungkan Toko
ms: Sambung Kedai

# notConnectedToShop
source: Not connected to a shop
id: Belum terhubung ke toko
ms: Belum disambungkan ke kedai

source: Subscription Status
id: Status Langganan
ms: Status Langganan

source: Cloud Backup & Restore
id: Backup & Restore Cloud
ms: Sandaran & Pemulihan Awan

# connectShopFirstForCloud
source: Connect to a Shop first to use Cloud Backup features.
id: Hubungkan ke Toko terlebih dahulu untuk menggunakan fitur Cloud Backup.
ms: Sambungkan ke Kedai dahulu untuk menggunakan ciri Sandaran Awan.

source: Backup Data
ms: Sandarkan Data

# backupDataDesc
source: Upload all local data to Cloud
id: Upload semua data lokal ke Cloud
ms: Muat naik semua data tempatan ke Awan

source: Upload data now?
id: Upload data sekarang?
ms: Muat naik data sekarang?

# dataWillBeOverwrittenProceed
source: Local data will be overwritten! Proceed?
id: Data lokal akan ditimpa! Lanjutkan?
ms: Data tempatan akan ditimpa! Teruskan?

source: Restore Data
ms: Pulihkan Data

# restoreDataDesc
source: Download and overwrite local data from Cloud
id: Download dan timpa data lokal dari Cloud
ms: Muat turun dan timpa data tempatan dari Awan

source: Local Backup & Restore
id: Backup & Restore Lokal
ms: Sandaran & Pemulihan Tempatan

source: Offline Backup (ZIP)
id: Backup Offline (ZIP)
ms: Sandaran Luar Talian (ZIP)

# offlineBackupZipDesc
source: Save database & photos to a ZIP file
id: Simpan database & foto ke file ZIP
ms: Simpan pangkalan data & gambar ke fail ZIP

source: Offline Restore (ZIP)
id: Restore Offline (ZIP)
ms: Pemulihan Luar Talian (ZIP)

# offlineRestoreZipDesc
source: Restore data from a ZIP file
id: Pulihkan data dari file ZIP
ms: Pulihkan data dari fail ZIP

source: Restore Offline
ms: Pulihkan Luar Talian

source: Secret Key
ms: Kunci Rahsia

source: Create New
id: Buat Baru
ms: Cipta Baru

# invalidIdOrKey
source: Invalid ID or Key, or check your internet connection.
id: ID atau Key salah, atau periksa koneksi internet.
ms: ID atau Kunci salah, atau periksa sambungan internet anda.

source: Connect
id: Hubungkan
ms: Sambung

source: Create New Shop
id: Buat Toko Baru
ms: Cipta Kedai Baru

# createNewShopDesc
source: ID and Secret Key will be automatically generated. You can also specify your own ID (optional). Current local data will be uploaded to the cloud.
id: ID dan Secret Key akan dibuat otomatis. Anda juga dapat menentukan ID sendiri (opsional). Data lokal saat ini akan di-upload ke cloud.
ms: ID dan Kunci Rahsia akan dijana secara automatik. Anda juga boleh menetapkan ID sendiri (pilihan). Data tempatan semasa akan dimuat naik ke awan.

source: Shop Name
id: Nama Toko
ms: Nama Kedai

source: Custom Shop ID (Optional)
id: Custom Shop ID (Opsional)
ms: ID Kedai Tersuai (Pilihan)

# customShopIdHint
source: e.g., JENICATHOUSE
id: Misal: JENICATHOUSE
ms: cth: JENICATHOUSE

# shopCreatedSuccess
source: Shop created successfully! ID: {shopId}
id: Toko berhasil dibuat! ID: {shopId}
ms: Kedai berjaya dicipta! ID: {shopId}

# shopCreatedFail
source: Failed to create shop. Check your connection.
id: Gagal membuat toko. Periksa koneksi.
ms: Gagal mencipta kedai. Periksa sambungan anda.

# createAndUpload
source: Create & Upload
id: Buat & Upload
ms: Cipta & Muat Naik

# restoreDataPrompt
source: Restore Data?
ms: Pulihkan Data?

# restoreDataPromptDesc
source: Connected successfully. Do you want to download & restore data from the cloud now?
id: Berhasil terhubung. Apakah Anda ingin download & restore data dari cloud sekarang?
ms: Berjaya disambungkan. Adakah anda ingin memuat turun & memulihkan data dari awan sekarang?

source: Later
id: Nanti Saja
ms: Nanti Saja

# restoreSuccess
source: Restore successful! Data is being updated.
id: Restore berhasil! Data sedang diperbarui.
ms: Pemulihan berjaya! Data sedang dikemas kini.

# restoreFail
source: Restore failed! Check your connection or Secret Key.
id: Restore gagal! Periksa koneksi atau Secret Key Anda.
ms: Pemulihan gagal! Periksa sambungan atau Kunci Rahsia anda.

source: Yes, Restore
id: Ya, Restore
ms: Ya, Pulihkan

# disconnectShopPrompt
source: Disconnect Shop?
id: Putuskan Koneksi?
ms: Putuskan Hubungan Kedai?

# disconnectShopDesc
source: Cloud backup and sync features will be disabled. Local data remains safe.
id: Fitur sinkronisasi dan backup cloud akan dinonaktifkan. Data lokal tetap aman.
ms: Ciri sandaran awan dan penyegerakan akan dinyahaktifkan. Data tempatan kekal selamat.

source: Shop connection disconnected
id: Koneksi toko diputuskan
ms: Sambungan kedai diputuskan

source: Disconnect
id: Putuskan
ms: Putuskan Hubungan

source: Yes, Proceed
id: Ya, Lanjutkan
ms: Ya, Teruskan

source: •••••••• (Hidden for security)
id: •••••••• (Tersembunyi demi keamanan)
ms: •••••••• (Tersembunyi untuk keselamatan)

source: Checking status...
id: Mengecek status...
ms: Menyemak status...

source: Check Status
id: Cek Status
ms: Semak Status

# validUntilValue
source: Valid Until: {date}
id: Berlaku Sampai: {date}
ms: Sah Sehingga: {date}

# deviceLimitValue
source: Device Limit: {count}
id: Limit Perangkat: {count}
ms: Had Peranti: {count}

# deviceIdValue
source: Device ID: {deviceId}
ms: ID Peranti: {deviceId}

# upgradeToProWhatsapp
source: Hello Admin, I want to upgrade my DataGrooming app to PRO. Shop ID: {shopId}
id: Halo Admin, saya ingin upgrade aplikasi DataGrooming saya ke PRO. ID Toko: {shopId}
ms: Helo Admin, saya ingin menaik taraf aplikasi DataGrooming saya ke PRO. ID Kedai: {shopId}

source: Upgrade to PRO
id: Tingkatkan ke PRO
ms: Naik Taraf ke PRO

# planFree
source: FREE
id: GRATIS
ms: PERCUMA

source: Home
id: Beranda
ms: Laman Utama

source: Activity
id: Aktivitas
ms: Aktiviti

source: Financial
id: Keuangan
ms: Kewangan

source: Quick Action
id: Aksi Cepat
ms: Tindakan Pantas

source: Hotel Check-in
id: Check-in Hotel
ms: Daftar Masuk Hotel

source: Cat List ({count})
id: Daftar Kucing ({count})
ms: Senarai Kucing ({count})

source: Hide Archived
id: Sembunyikan Arsip
ms: Sembunyikan Arkib

source: View Archived
id: Lihat Terarsip
ms: Lihat yang Diarkibkan

# searchCatOrOwner
source: Search Cat / Owner
id: Cari Kucing / Owner
ms: Cari Kucing / Pemilik

# noCatsMatchSearch
source: No cats match the search.
id: Tidak ada kucing yang cocok dengan pencarian.
ms: Tiada kucing yang sepadan dengan carian.

source: No cat data yet.
id: Belum ada data kucing.
ms: Tiada data kucing lagi.

source: Try another keyword.
id: Coba kata kunci lain.
ms: Cuba kata kunci lain.

# tapPlusToAddCat
source: Tap the + button to add a cat.
id: Tap tombol + untuk menambah kucing.
ms: Ketik butang + untuk menambah kucing.

# dataLockedStarterLimit
source: This data is locked (Starter Limit 15). Please upgrade to PRO!
id: Data ini terkunci (Limit Starter 15). Silakan upgrade ke PRO!
ms: Data ini dikunci (Had Starter 15). Sila naik taraf ke PRO!

# starterLimit15CatsReached
source: Starter limit of 15 cats reached! Please upgrade to PRO.
id: Batas Starter 15 kucing tercapai! Silakan upgrade ke PRO!
ms: Had Starter 15 kucing telah dicapai! Sila naik taraf ke PRO.

# archiveCatPrompt
source: Archive Cat?
id: Arsipkan Kucing?
ms: Arkibkan Kucing?

# archiveCatDesc
source: "{catName}" has transaction history and cannot be deleted. By archiving, financial data remains safe but the cat will no longer appear in lists and reminders.
id: "{catName}" memiliki riwayat transaksi dan tidak bisa dihapus. Dengan mengarsipkan, data keuangan tetap aman namun kucing tidak akan muncul lagi di daftar dan pengingat.
ms: "{catName}" mempunyai sejarah transaksi dan tidak boleh dipadamkan. Dengan mengarkibkan, data kewangan kekal selamat tetapi kucing tidak akan muncul lagi dalam senarai dan peringatan.

source: Archive
id: Arsipkan
ms: Arkibkan

# catArchivedSuccess
source: {catName} has been archived
id: {catName} telah diarsipkan
ms: {catName} telah diarkibkan

# unarchiveCatPrompt
source: Reactivate?
id: Aktifkan Kembali?
ms: Aktifkan Semula?

# unarchiveCatDesc
source: Do you want to restore "{catName}"? This cat will reappear in the active list.
id: Apakah Anda ingin memulihkan "{catName}"? Kucing ini akan muncul kembali di daftar aktif.
ms: Adakah anda ingin memulihkan "{catName}"? Kucing ini akan muncul kembali dalam senarai aktif.

# unarchive
source: Reactivate
id: Aktifkan
ms: Aktifkan

# catUnarchivedSuccess
source: {catName} has been reactivated
id: {catName} telah diaktifkan kembali
ms: {catName} telah diaktifkan semula

# deleteFailedHasHistory
source: Delete failed: This cat has history. Use the Archive feature.
id: Hapus gagal: Kucing ini memiliki riwayat. Gunakan fitur Arsip.
ms: Pemadaman gagal: Kucing ini mempunyai sejarah. Gunakan ciri Arkib.

# deleteCatPrompt
source: Delete Cat?
id: Hapus Kucing?
ms: Padam Kucing?

# deleteCatDesc
source: Are you sure you want to delete "{catName}"? All grooming history will also be deleted.
id: Apakah Anda yakin ingin menghapus "{catName}"? Semua riwayat grooming juga akan dihapus.
ms: Adakah anda pasti ingin memadamkan "{catName}"? Semua sejarah grooming juga akan dipadamkan.

# catDeletedSuccess
source: {catName} has been deleted
id: {catName} telah dihapus
ms: {catName} telah dipadam

source: Cat not found.
id: Kucing tidak ditemukan.
ms: Kucing tidak dijumpai.

source: Grooming History ({count})
id: Riwayat Grooming ({count})
ms: Sejarah Grooming ({count})

source: No grooming history yet.
id: Belum ada riwayat grooming.
ms: Tiada sejarah grooming lagi.

source: Information
id: Informasi
ms: Maklumat

source: Phone
id: Telepon
ms: Telefon

source: Fur Color
id: Warna Bulu
ms: Warna Bulu

source: Eye Color
id: Warna Mata
ms: Warna Mata

source: Weight
id: Berat
ms: Berat

source: Sterile
id: Steril
ms: Steril

# isSterileYes
source: Sterilized
id: Sudah Steril
ms: Sudah Steril

# isSterileNo
source: Not Sterilized
id: Belum Steril
ms: Belum Steril

source: Loyalty Completed! 🎉
ms: Tugasan Kesetiaan Selesai! 🎉

# groomingReportShare
source: Grooming Report Cat: {catName} Date: {date} Cost: {cost} Notes: {notes}
id: Grooming Report Kucing: {catName} Tanggal: {date} Biaya: {cost} Catatan: {notes}
ms: Laporan Grooming Kucing: {catName} Tarikh: {date} Kos: {cost} Nota: {notes}

source: Choose Profile Photo
id: Pilih Foto Profil
ms: Pilih Foto Profil

source: Camera
id: Kamera
ms: Kamera

source: Gallery
id: Galeri
ms: Galeri

source: Edit Cat
id: Edit Kucing
ms: Edit Kucing

source: Add Cat
id: Tambah Kucing
ms: Tambah Kucing

source: Cat Info
id: Info Kucing
ms: Maklumat Kucing

# catNameLabel
source: Cat Name
id: Nama Kucing
ms: Nama Kucing

source: Weight (kg)
id: Berat Badan (kg)
ms: Berat (kg)

source: Gender
id: Jenis Kelamin
ms: Jantina

source: Male
id: Jantan
ms: Jantan

source: Female
id: Betina
ms: Betina

source: Yes, sterilized
id: Ya, sudah steril
ms: Ya, sudah steril

source: Not sterilized yet
id: Belum steril
ms: Belum steril

source: Owner Info
id: Info Pemilik
ms: Maklumat Pemilik

# ownerPhoneLabel
source: Owner Phone No.
id: No. Telp Pemilik
ms: No. Telp Pemilik

source: Warning
id: Peringatan
ms: Amaran

source: Permanent Warning Note
id: Catatan Peringatan Permanen
ms: Nota Amaran Kekal

# warningNoteExample
source: Example: Aggressive, Weak Heart
id: Contoh: Galak, Jantung Lemah
ms: Contoh: Agresif, Jantung Lemah

# limitReached15
source: LIMIT REACHED (15 Cats)
id: LIMIT TERCAPAI (15 Ekor)
ms: HAD DICAPAI (15 Ekor)

# freeVersionUpgradeToPro
source: You are using the Free version. Please upgrade to PRO to add unlimited data.
id: Anda menggunakan versi Gratis. Silakan upgrade ke PRO untuk menambah data tanpa batas.
ms: Anda menggunakan versi Percuma. Sila naik taraf ke PRO untuk menambah data tanpa had.

source: Update Cat
id: Update Kucing
ms: Kemas kini Kucing

source: Save Cat
id: Simpan Kucing
ms: Simpan Kucing

# fieldRequired
source: {field} is required
id: {field} wajib diisi
ms: {field} wajib diisi

source: Enter {field}
id: Masukkan {field}
ms: Masukkan {field}

source: Owner Name
id: Nama Pemilik
ms: Nama Pemilik

# ownerNameRequired
source: Owner Name is required
id: Nama Pemilik wajib diisi
ms: Nama Pemilik wajib diisi

source: Search or enter owner name
id: Cari atau masukkan nama pemilik
ms: Cari atau masukkan nama pemilik

# onlySelectSameOwnerSession
source: Can only select sessions from the same owner ({ownerName})
id: Hanya bisa memilih session dari pemilik yang sama ({ownerName})
ms: Hanya boleh pilih sesi daripada pemilik yang sama ({ownerName})

# printFailed
source: Failed to print: {error}
id: Gagal mencetak: {error}
ms: Gagal mencetak: {error}

# selectedCount
source: {count} selected
id: {count} dipilih
ms: {count} dipilih

# selectAllOwner
source: Select All (owner {ownerName})
id: Pilih Semua (owner {ownerName})
ms: Pilih Semua (pemilik {ownerName})

# printCombinedInvoiceBtn
source: Print Combined Invoice
id: Cetak Invoice Gabungan
ms: Cetak Invois Gabungan

# sessionHistoryTitle
source: Session History
id: Riwayat Session
ms: Sejarah Sesi

source: Search session...
id: Cari session...
ms: Cari sesi...

# ownerOnlySessionWarning
source: Owner: {ownerName} — only sessions from this owner can be selected
id: Owner: {ownerName} — hanya session dari owner ini yang bisa dipilih
ms: Pemilik: {ownerName} — hanya sesi dari pemilik ini yang boleh dipilih

source: No sessions yet.
id: Belum ada session.
ms: Belum ada sesi.

source: Not found.
id: Tidak ditemukan.
ms: Tidak dijumpai.

# tapPlusButtonInCatDetail
source: Tap the + button in cat details.
id: Tap tombol + di detail kucing.
ms: Ketik butang + di butiran kucing.

# sessionStarted
source: Session started! Added to queue.
id: Sesi dimulai! Masuk antrian.
ms: Sesi bermula! Masuk dalam barisan.

source: Grooming Check-In
ms: Daftar Masuk Grooming

source: Start New Session
id: Mulai Sesi Baru
ms: Mula Sesi Baru

source: Add New Cat
id: Tambah Kucing Baru
ms: Tambah Kucing Baru

source: Check In (Start Queue)
id: Check In (Mulai Antrian)
ms: Daftar Masuk (Mula Barisan)

# currentQueue
source: Current Queue ({count})
id: Antrian Saat Ini ({count})
ms: Barisan Semasa ({count})

source: No active queue.
id: Tidak ada antrian aktif.
ms: Tiada barisan aktif.

source: Unknown Cat
id: Kucing Tidak Diketahui
ms: Kucing Tidak Diketahui

# setShopIdInSettings
source: Please set Shop ID in Settings
id: Silakan atur Shop ID di Settings
ms: Sila tetapkan ID Kedai di Tetapan

# trackingTokenNotAvailable
source: Error: Tracking token not available
id: Error: Token tracking belum tersedia
ms: Ralat: Token penjejakan tidak tersedia

# whatsappTrackingMessage
source: Hi {ownerName} 👋 To track {catName}'s grooming progress, you can check this link: {link} Thank you for trusting us! 🐱✨
id: Hai kak {ownerName} 👋 Untuk memantau proses grooming {catName} sampai di tahap mana, bisa langsung dicek di link berikut ya: {link} Terima kasih sudah mempercayakan kami! 🐱✨
ms: Hai {ownerName} 👋 Untuk memantau proses grooming {catName} sehingga tahap mana, boleh terus disemak di pautan ini ya: {link} Terima kasih kerana mempercayai kami! 🐱✨

# ownerLabel
source: Owner: {ownerName}
ms: Pemilik: {ownerName}

source: Breed
id: Ras / Jenis
ms: Baka

source: Share Link
ms: Kongsi Pautan

# bookingGrooming
source: Grooming Booking
id: Booking Grooming
ms: Tempahan Grooming

source: No booking schedule.
id: Tidak ada jadwal booking.
ms: Tiada jadual tempahan.

source: Add Booking
id: Tambah Booking
ms: Tambah Tempahan

source: Service Type
id: Jenis Layanan
ms: Jenis Perkhidmatan

source: Delete Schedule
id: Hapus Jadwal
ms: Padam Jadual

# deleteScheduleConfirm
source: Permanently delete this schedule?
id: Hapus jadwal ini secara permanen?
ms: Padam jadual ini secara kekal?

source: Confirm
id: Konfirmasi
ms: Sahkan

# cancelBooking
source: Cancel
id: Batalkan
ms: Batalkan

source: Reschedule
id: Jadwalkan Ulang
ms: Jadualkan Semula

# dateLabel
source: Date
id: Tanggal
ms: Tarikh

# serviceLabel
source: Service
id: Layanan
ms: Perkhidmatan

source: WhatsApp Reminder
ms: Peringatan WhatsApp

source: Check-In
ms: Daftar Masuk

# bookingOn
source: Booking on {date}
id: Booking pada {date}
ms: Tempahan pada {date}

# shortMonday
source: Mon
id: Sen
ms: Isn

# shortTuesday
source: Tue
id: Sel
ms: Sel

# shortWednesday
source: Wed
id: Rab
ms: Rab

# shortThursday
source: Thu
id: Kam
ms: Kha

# shortFriday
source: Fri
id: Jum
ms: Jum

# shortSaturday
source: Sat
id: Sab
ms: Sab

# shortSunday
source: Sun
id: Min
ms: Aha

source: No schedule.
id: Tidak ada jadwal.
ms: Tiada jadual.

source: Edit Session
ms: Edit Sesi

source: Session not found.
id: Session tidak ditemukan.
ms: Sesi tidak dijumpai.

source: Delete Session
id: Hapus Sesi
ms: Padam Sesi

# deleteSessionConfirm
source: Are you sure? Data cannot be restored.
id: Yakin hapus? Data tidak bisa dikembalikan.
ms: Pasti ingin padam? Data tidak boleh dipulihkan.

source: Findings
ms: Penemuan

source: Add
id: Tambah
ms: Tambah

source: Treatments
ms: Rawatan

source: Notes
id: Catatan
ms: Nota

source: Total Cost
id: Total Biaya
ms: Jumlah Kos

source: Pay from Deposit
id: Bayar dari Deposit
ms: Bayar dari Deposit

# balanceStr
source: Balance: {balance}
id: Saldo: {balance}
ms: Baki: {balance}

# balanceNotEnoughDeduct
source: Insufficient balance, {deductedAmount} will be deducted
id: Saldo kurang, akan dipotong {deductedAmount}
ms: Baki tidak mencukupi, {deductedAmount} akan dipotong

source: Session Detail
ms: Butiran Sesi

source: Print Invoice
id: Cetak Invoice
ms: Cetak Invois

source: Cat data not found
id: Data kucing tidak ditemukan
ms: Data kucing tidak dijumpai

source: Groomer Notes
id: Catatan Groomer
ms: Nota Groomer

source: Unknown
id: Tidak Diketahui
ms: Tidak Diketahui

# monthJan
source: January
id: Januari
ms: Januari

# monthFeb
source: February
id: Februari
ms: Februari

# monthMar
source: March
id: Maret
ms: Mac

# monthMay
source: May
id: Mei
ms: Mei

# monthJun
source: June
id: Juni
ms: Jun

# monthJul
source: July
id: Juli
ms: Julai

# monthAug
source: August
id: Agustus
ms: Ogos

# monthOct
source: October
id: Oktober
ms: Oktober

# monthDec
source: December
id: Desember
ms: Disember

# statusScheduled
source: Scheduled
id: Dipesan
ms: Dijadualkan

# statusCompleted
source: Completed
id: Selesai
ms: Selesai

# statusConfirmed
source: Confirmed
id: Dikonfirmasi
ms: Disahkan

# statusCancelled
source: Cancelled
id: Dibatalkan
ms: Dibatalkan

# hotelKucing
source: Cat Hotel
id: Hotel Kucing
ms: Hotel Kucing

source: Room Status
id: Status Kamar
ms: Status Bilik

source: Billing
id: Biaya
ms: Pengebilan

source: History
id: Riwayat
ms: Sejarah

# noRooms
source: No rooms yet.
id: Belum ada kamar.
ms: Tiada bilik lagi.

# roomLockedStarterLimit
source: This room is locked (Starter Limit 2). Please upgrade to PRO!
id: Kamar ini terkunci (Limit Starter 2). Silakan upgrade ke PRO!
ms: Bilik ini dikunci (Had Starter 2). Sila naik taraf ke PRO!

# editBookingFor
source: Edit Booking: {catName}
ms: Sunting Tempahan: {catName}

source: Check-in Date
id: Tanggal Masuk
ms: Tarikh Daftar Masuk
